//1. Создайте метод sum - который в качестве аргумента берет 2 целых числа
//        и печатает их результат на экране.
//        вызовите этот метод из функции main() (подсказка
//        - тип функции будет void)
//
//
//        2. Создайте метод sum - который в качестве аргумента берет 2 целых
//        числа и возвращает их сумму.
//        вызовите этот метод внутри функии main(), сохраните результат
//        в переменной и выведите результат на экран
//        (подсказка - тип функции будет int)
//
//
//        3. Создайте метод isEven - который в качестве аргумента берет
//        целое число и если оно четное возвращает true
//        если нечетное - возвращает false
//        вызовите этот метод внутри функии main(),
//        сохраните результат в переменной и выведите результат на экран