public class App {
    public static void main(String[] args) {
        System.out.println("Hello, world");
        System.out.println("Hello students");


    }

//    1. Создайте метод sum - который в качестве аргумента
//    берет int[] и возвращает его сумму.
//    вызовите этот метод из функции main() - подайте
//    в качестве параматра {2,3,5,6,7,8}
//
//2. Создайте метод sort - который в качестве аргумента
// берет int[] и выводит на экран сортированную последовательность
// по возрастанию.
//    вызовите этот метод внутри функии main()
//    подайте в качестве параматра {3,9,1,8,4,8,5}
//
//3. Создайте метод, который в качестве аргумента
// берет int[] и возвращает максимальное/минимальное значение
//            (группа мак - макчимальное/ группа win - минимальное)
//    подайте в качестве параматра {3,9,1,8,4,8,5}
//
}
